hailp-vn38/esp-ble-device/devices/reference_device/sdkconfig.defaults
# ============================================================
# ESP32-S3 BLE Device — sdkconfig.defaults
# Target: ESP32-S3 (Dual-Core Xtensa LX7 240MHz)
# Flash: 4MB | SRAM: 512KB | BLE 5.0 + WiFi 2.4GHz
# ============================================================

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Flash (4MB) ---
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- Partition Table: custom (4MB layout) ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- CPU / Performance ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# Peripheral-only (no Central/Observer per Gateway contract)
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

CONFIG_BT_NIMBLE_GATT_SERVER=y

# One connection (Phase 1: Gateway owns connections)
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# Security: bonding + LE Secure Connections, persisted in NVS
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SM_BONDING=y
CONFIG_BT_NIMBLE_SM_MITM=n
CONFIG_BT_NIMBLE_SM_IOCAP=NONE
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# Preferred MTU 256 (runtime always uses negotiated value)
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256

# BLE 5.0 features
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=y

# --- WiFi (2.4GHz 802.11 b/g/n) ---
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# --- Memory ---
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_BT_NIMBLE_TASK_STACK_SIZE=4096

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- USB ---
CONFIG_TINYUSB_ENABLED=y
